<?php

namespace Database\Seeders;

use App\Models\Page;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class PageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $model = Page::first();
        if(!$model)
        {
            $json_file = file_get_contents(public_path("db/pages.json"));
            $data = json_decode($json_file, true);
            foreach ($data as $item)
            {
                Page::create($item);
            }
        }
//        $home = Page::create([
//            'status' => true,
//            'name' => 'صفحه اصلی',
//            'slug' => 'home',
//            'meta' => 'توضیحات متای صفحه اصلی سایت',
//            'description' => "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
//لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
//"
//        ]);
//        Page::create([
//            'status' => true,
//            'name' => 'درباره ما',
//            'slug' => 'about',
//            'meta' => 'درباره ما',
//            'description' => "ما در مارلیک افزار انواع خدمات برنامه نویسی، طراحی سایت و میزبانی وب رو به کاربران عزیز ارایه میکنیم."
//        ]);
//        Page::create([
//            'status' => true,
//            'name' => 'تماس با ما',
//            'slug' => 'contact',
//            'meta' => 'تماس با ما',
//            'description' => "برای ارتباط با ما میتونید با لمس آیکون های شبکه های اجتماعی در فوتر سایت ارتباط برقرار کنید. یا با شماره 09192138510 تماس بگیرید."
//        ]);
//
//        Page::create([
//            'status' => true,
//            'name' => 'قوانین',
//            'slug' => 'terms',
//            'meta' => 'قوانین',
//            'description' => ""
//        ]);
//
//        Page::create([
//            'status' => true,
//            'name' => 'سوالات متداول',
//            'slug' => 'faq',
//            'meta' => 'سوالات متداول',
//            'description' => ""
//        ]);
//
//        Page::create([
//            'status' => true,
//            'name' => 'نماد اعتماد',
//            'slug' => 'enamad',
//            'meta' => 'نماد اعتماد',
//            'description' => "نمادها و مجوزهای ما"
//        ]);
//
//        Page::create([
//            'status' => true,
//            'name' => 'خرید قسطی',
//            'slug' => 'installment-payment',
//            'meta' => 'امکان پرداخت فاکتورها بصورت قسطی در مارلیک افزار مهیا میباشد.',
//            'description' => "برای پرداخت فاکتورها بصورت اقسازی، میتوانید از درگاههای پرداخت ترب پی و اسنپ پی استفاده نمایید."
//        ]);
//
//        Page::create([
//            'status' => true,
//            'name' => 'پرداخت رمز ارزی',
//            'slug' => 'cryptocurrency-payment',
//            'meta' => 'امکان خرید محصولات و خدمات ما با رمزارزها مهیا میباشد.',
//            'description' => "کاربرانی که خارج از ایران حضور دارند، میتوانند از امکان پرداخت رمزارزی ما استفاده کنند. لطفا قبل از پرداخت با پشتیبانی هماهنگ نمایید."
//        ]);
    }
}
