<?php

return [
    'created' => 'آیتم جدید با موفقیت ذخیره شد.',
    'updated' => 'آیتم با موفقیت بروزرسانی شد.',
    'deleted' => 'آیتم با موفقیت حذف شد.',
    'restored' => 'آیتم با موفقیت بازیابی شد.',
    'error' => 'خطایی در اجرای درخواست رخ داد.',
    'default_access_denied' => 'نمیتوانید آیتم پیشفرض را حذف نمایید.',
    'access_denied' => 'دسترسی نامعتبر',
    'invalid_authentication' => 'کاربری با این مشخصات پیدا نشد',
    'invalid_register' => 'اطلاعات وارد شده برای ثبت نام نامعتبر است',
];
